Repository: juliusyam/patient-analytics_cs-backend
Catalog: PatientAnalytics/Blazor/Localization/Localized.*.resx
Languages: de, zh

# AppTitle
source: Patient Analytics
de: Patientenanalyse
zh: 患者分析

# Title_DoctorDashboard
source: Doctor Dashboard
de: Arzt-Dashboard
zh: 醫生介面

# Title_AdminDashboard
source: Admin Dashboard
zh: 行政介面

# Title_PatientDashboard
source: Patient Dashboard
de: Patienten-Dashboard
zh: 病人介面

# Title_PatientDashboard_WithPatientName
source: {0} {1} - Patient Dashboard
de: {0} {1} - Patienten-Dashboard
zh: {1}, {0} - 病人介面

# Title_UserManagement_Doctors
source: User Management - Doctors
de: Benutzerverwaltung – Arzt
zh: 用戶管理 - 醫生

# Title_UserManagement_Admins
source: User Management - Admins
de: Benutzerverwaltung – Admin
zh: 用戶管理 - 管理員

# Title_UserManagement_SuperAdmins
source: User Management - Super Admins
de: Benutzerverwaltung – Super-Admin
zh: 用戶管理 - 超級管理員

# Title_Doctors
source: Doctors
de: Ärzte / Ärztinnen
zh: 醫生名單

# Title_Admins
source: Admins
de: Administratoren
zh: 管理員名單

# Title_SuperAdmins
source: Super Admins
de: Superadministratoren
zh: 超級管理員名單

# Title_DoctorCreate
source: Create New Doctor
de: Neuen Arzt erstellen
zh: 建立醫生

# Title_AdminCreate
source: Create New Admin
de: Neuen Admin erstellen
zh: 建立管理員

# Title_SuperAdminCreate
source: Create New Super Admin
de: Neuen Super-Admin erstellen
zh: 建立超級管理員

# Title_Login
source: Login
de: Anmeldung
zh: 登入

# Title_Patients
source: Patients
de: Patient(in)
zh: 你的病人

# Label_Username
source: Username
de: Nutzername
zh: 賬戶名

# Label_Password
source: Password
de: Passwort
zh: 密碼

# Label_Email
source: Email
zh: 電郵地址

# Label_Name
source: Name
zh: 姓名

# Label_Gender
source: Gender
de: Geschlecht
zh: 性別

# Label_DateOfBirth
source: Date of Birth
de: Geburtsdatum
zh: 出生日期

# Label_DateOfBirth_Abbreviated
source: DoB
de: Geburtsdatum
zh: 出生日期

# Label_DateCreated
source: Date Created
de: Datum erstellt
zh: 病人首次登記日期

# Label_DateEdited
source: Date Edited
de: Datum der Bearbeitung
zh: 病人最近更改日期

# Label_Address
source: Address
de: Adresse
zh: 地址

# Label_ViewDetails
source: View Details
de: Details anzeigen
zh: 觀看詳情

# Label_Loading
source: Loading...
de: Wird geladen...
zh: 準備中...

# Placeholder_Username
source: e.g. patient_analytics_doctor1
de: e.g. arzt_fuer_patientenanalytik1
zh: 例如：patient_analytics_doctor1

# Button_Submit
source: Submit
de: Einreichen
zh: 提交

# Button_View
source: View
de: Sicht
zh: 觀看

# Button_Logout
source: Logout
de: Ausloggen
zh: 登出

# Button_UserCreate
source: Create User
de: Benutzer erstellen
zh: 建立用戶

# Message_UnauthorizedRedirect
source: You are not authorized to view this page. Redirecting...
de: Sie sind nicht berechtigt, diese Seite anzuzeigen. Weiterleitung...
zh: 您沒有充足權力查看此頁面。重新定向中。

# Message_DashboardWelcome
source: Welcome back, {0}
de: Willkommen, {0}
zh: 歡迎， {0}

# DateFormatting_Date
source: dd MMM yyyy
zh: yyyy年MM月dd日

# DateFormatting_DateTime
source: dd MMM yyyy - HH:mm:ss
zh: yyyy年MM月dd日 - HH:mm:ss

# Button_Back
source: Back
de: Zurück
zh: 後退

# Button_Cancel
source: Cancel
de: Stornieren
zh: 取消

# Button_Confirm
source: Confirm
de: Bestätigen
zh: 確認

# Button_Create
source: Create
de: Erstellen
zh: 創造

# Button_Create_New_Patient
source: Create New Patient
de: Neuen Patienten erstellen
zh: 建立新患者

# Button_Create_Patient
source: Create Patient
de: Patienten anlegen
zh: 創建病人

# Button_Delete
source: Delete
de: Löschen
zh: 刪除

# Button_Edit
source: Edit Patient
de: Patient Bearbeiten
zh: 編輯詳細信息

# Button_Update
source: Update
de: Aktualisieren
zh: 更新

# Label_First_Name
source: First Name
de: Vorname
zh: 名

# Label_Last_Name
source: Last Name
de: Nachname
zh: 姓

# Placeholder_Address
source: e.g. 10 Downing Street
de: e.g. 1 Willy Brandt Avenue Tiergarten
zh: 例如：中國北京市西城區福佑街2號

# Placeholder_DateOfBirth
source: e.g. 15/05/2000
zh: 例如：2000年2月15日

# Placeholder_Email
source: e.g. b.jones@hotmail.com
de: e.g. e.schmidt@hotmail.com
zh: 例如：x.wang@email.com

# Placeholder_First_Name
source: e.g. Bob
de: e.g. Emilia
zh: 例如：翔

# Placeholder_Gender
source: e.g. Male / Female
de: e.g. Männlich / Weiblich
zh: 男 / 女

# Placeholder_Last_Name
source: e.g. Smith
de: e.g. Schmidt
zh: 例如：王

# Title_Delete_Patient
source: Delete Patient
de: Patient Löschen
zh: 刪除患者

# Button_BloodPressure
source: Blood Pressure
de: Blutdruck
zh: 血壓

# Button_Height
source: Height
de: Höhe
zh: 高度

# Button_Weight
source: Weight
de: Gewicht
zh: 重量

# Button_Temperature
source: Temperature
de: Temperatur
zh: 溫度

# Label_BP_Systolic
source: BP Systolic
de: Systolischer Blutdruck
zh: 收縮壓

# Label_BP_Diastolic
source: BP Diastolic
de: Blutdruck diastolisch
zh: 舒張壓

# Label_Status
source: Status
zh: 地位

# Label_Doctor
source: Doctor
de: Arzt / Ärztin
zh: 醫生

# Label_Selected_Unit
source: Selected Unit
de: Ausgewählte Einheit
zh: 選定單位

# Label_Unit
source: Unit
de: Einheit
zh: 單元

# Label_Celsius
source: Celsius
zh: 攝氏度

# Label_Fahrenheit
source: Fahrenheit
zh: 華氏度

# Error_InvalidRole
source: Invalid Role Value. Role Value can either be SuperAdmin, Admin or Doctor.
de: Ungültiger Rollenwert. Der Rollenwert kann entweder SuperAdmin, Admin oder Doctor sein.
zh: 角色值無效。角色值可以是超級管理員、管理員或醫生。

# Error_HeightRequired
source: Height value is required.
de: Höhenwert ist erforderlich.
zh: 高度值是必要的。

# Error_UnitRequired
source: Unit is required.
de: Einheit ist erforderlich.
zh: 單位為必填項。

# Error_BloodPressureSystolicRequired
source: Blood Pressure Systolic value is required.
de: Der systolische Blutdruckwert ist erforderlich, und muss größer als 0 sein.
zh: 血壓 需要收縮值。

# Error_BloodPressureDiastolicRequired
source: Blood Pressure Diastolic value is required.
de: Der diastolische Blutdruckwert ist erforderlich, und muss größer als 0 sein.
zh: 血壓 需要舒張值。

# Error_WeightRequired
source: Weight value is required.
de: Gewichtswert ist erforderlich, und muss größer als 0 sein.
zh: 重量值是必需的。

# Error_TemperatureRequired
source: Temperature value is required.
de: Temperaturwert ist erforderlich, und muss größer als 0 sein.
zh: 需要溫度值。

# Unit_Cm
source: Cm
zh: 厘米

# Unit_In
source: In
de: Zoll
zh: 英寸

# Unit_Ft
source: Ft
zh: 英尺

# Unit_Kg
source: Kg
zh: 公斤

# Unit_St
source: St
de: Stein
zh: 英石

# Unit_Lb
source: Lb
zh: 磅

# Unit_Celsius
source: Celsius
zh: 攝氏度

# Unit_Fahrenheit
source: Fahrenheit
zh: 華氏度

# Message_No_Email
source: Email Not Available
de: E-Mail nicht verfügbar
zh: 電子郵件不可用

# Button_Download_Report
source: Download Report
de: Bericht herunterladen
zh: 下載報告

# SignalRMessage_UserLoggedIn
source: {0} has signed in.
de: {0} hat sich angemeldet.

# SignalRMessage_UserLoggedOut
source: {0} has signed off.
de: {0} hat sich abgemeldet.
